odin_projects/blogger/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new title"], ["body", "new body"], ["created_at", 2016-08-04 06:56:43 UTC], ["updated_at", 2016-08-04 06:56:43 UTC]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "new body to update"], ["updated_at", 2016-08-04 07:48:10 UTC], ["id", 16]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)