odin_projects/blogger/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Isabella"], ["body", "comment. "], ["article_id", 21], ["created_at", 2016-08-06 17:59:30 UTC], ["updated_at", 2016-08-06 17:59:30 UTC]]
---
  def create
  @comment = Comment.new(comment_params)
  @comment.article_id = params[:article_id]

  @comment.save